{
  "doctors": [
    {
      "id": "doc-1",
      "name": "Dr. Sarah Johnson",
      "image": "https://images.pexels.com/photos/7966284/pexels-photo-7966284.jpeg",
      "education": "MD, Cardiology, Harvard Medical School",
      "speciality": "Cardiologist",
      "experience": "15 years",
      "registration": "MED-12345",
      "designation": "Senior Cardiologist",
      "workplace": "City Heart Hospital",
      "fee": 2200,
      "availability": ["Monday", "Wednesday", "Friday"],
      "bio": "Specializes in interventional cardiology with extensive experience in angioplasty.",
      "details": "Dr. Sarah Johnson is a highly experienced cardiologist with 15 years of practice, specializing in interventional cardiology. A Harvard Medical School graduate, she has performed over 2,000 angioplasties and is renowned for her expertise in complex coronary interventions. At City Heart Hospital, she leads a team that pioneers minimally invasive cardiac procedures. Her research on stent technologies has been published in several medical journals."
    },
    {
      "id": "doc-2",
      "name": "Dr. Michael Chen",
      "image": "https://images.pexels.com/photos/6303775/pexels-photo-6303775.jpeg",
      "education": "MD, Neurology, Johns Hopkins University",
      "speciality": "Neurologist",
      "experience": "12 years",
      "registration": "MED-23456",
      "designation": "Head of Neurology",
      "workplace": "NeuroCare Institute",
      "fee": 2500,
      "availability": ["Tuesday", "Thursday", "Saturday"],
      "bio": "Expert in treating migraines and neurodegenerative disorders.",
      "details": "Dr. Michael Chen, a Johns Hopkins-trained neurologist, has dedicated 12 years to treating complex neurological conditions. As Head of Neurology at NeuroCare Institute, he developed innovative treatment protocols for migraine sufferers and Parkinson's patients. His multidisciplinary approach combines medication management with lifestyle interventions. Dr. Chen's work on early dementia detection has been recognized with the National Neurology Excellence Award."
    },
    {
      "id": "doc-3",
      "name": "Dr. Emily Rodriguez",
      "image": "https://images.pexels.com/photos/5327864/pexels-photo-5327864.jpeg",
      "education": "MD, Pediatrics, Stanford University",
      "speciality": "Pediatrician",
      "experience": "8 years",
      "registration": "MED-34567",
      "designation": "Pediatric Specialist",
      "workplace": "Children's Wellness Center",
      "fee": 3000,
      "availability": ["Monday", "Tuesday", "Wednesday", "Friday"],
      "bio": "Passionate about child healthcare and preventive medicine.",
      "details": "Dr. Emily Rodriguez brings Stanford University's pediatric expertise to the Children's Wellness Center. With 8 years of experience, she focuses on preventive care through vaccination programs and nutritional counseling. Her child-friendly approach makes her popular among young patients. Dr. Rodriguez established the 'Healthy Start' initiative that reduced childhood obesity rates by 30% in her community."
    },
    {
      "id": "doc-4",
      "name": "Dr. James Wilson",
      "image": "https://images.pexels.com/photos/7578806/pexels-photo-7578806.jpeg",
      "education": "MD, Orthopedics, Mayo Clinic",
      "speciality": "Orthopedic Surgeon",
      "experience": "18 years",
      "registration": "MED-45678",
      "designation": "Chief of Orthopedics",
      "workplace": "Bone & Joint Hospital",
      "fee": 2700,
      "availability": ["Wednesday", "Thursday", "Saturday"],
      "bio": "Specializes in sports injuries and joint replacements.",
      "details": "With 18 years of orthopedic practice, Dr. James Wilson is a Mayo Clinic-trained surgeon specializing in advanced joint replacement techniques. As Chief of Orthopedics, he introduced robotic-assisted surgeries that reduced recovery time by 40%. His work with professional athletes has revolutionized sports injury rehabilitation protocols. Dr. Wilson holds patents for two innovative surgical instruments."
    },
    {
      "id": "doc-5",
      "name": "Dr. Olivia Smith",
      "image": "https://images.pexels.com/photos/5407206/pexels-photo-5407206.jpeg",
      "education": "MD, Dermatology, Yale School of Medicine",
      "speciality": "Dermatologist",
      "experience": "10 years",
      "registration": "MED-56789",
      "designation": "Skin Care Specialist",
      "workplace": "Skin Health Clinic",
      "fee": 2300,
      "availability": ["Monday", "Wednesday", "Friday", "Saturday"],
      "bio": "Expert in cosmetic dermatology and skin cancer prevention.",
      "details": "Dr. Olivia Smith, a Yale-educated dermatologist, combines medical and cosmetic dermatology expertise at her Skin Health Clinic. Her decade of experience includes pioneering work in non-invasive skin rejuvenation techniques. She established the region's first mobile skin cancer screening unit, detecting over 500 early-stage melanomas. Dr. Smith's research on sun damage prevention is widely cited in dermatology textbooks."
    },
    {
      "id": "doc-6",
      "name": "Dr. Robert Taylor",
      "image": "https://images.pexels.com/photos/8376266/pexels-photo-8376266.jpeg",
      "education": "MD, General Surgery, UCLA",
      "speciality": "General Surgeon",
      "experience": "14 years",
      "registration": "MED-67890",
      "designation": "Surgical Consultant",
      "workplace": "City General Hospital",
      "fee": 2400,
      "availability": ["Tuesday", "Thursday", "Friday"],
      "bio": "Specializes in minimally invasive surgical techniques.",
      "details": "Dr. Robert Taylor is a UCLA-trained general surgeon renowned for his expertise in laparoscopic procedures. At City General Hospital, he reduced average hospital stays by implementing enhanced recovery protocols. With 14 years of surgical experience, he's performed over 5,000 successful operations. Dr. Taylor trains surgeons nationwide on advanced minimally invasive techniques through the American College of Surgeons."
    },
    {
      "id": "doc-7",
      "name": "Dr. Anita Desai",
      "image": "https://images.pexels.com/photos/6129118/pexels-photo-6129118.jpeg",
      "education": "MD, Ophthalmology, AIIMS",
      "speciality": "Ophthalmologist",
      "experience": "9 years",
      "registration": "MED-78901",
      "designation": "Eye Specialist",
      "workplace": "Vision Care Center",
      "fee": 2800,
      "availability": ["Monday", "Thursday", "Saturday"],
      "bio": "Expert in cataract surgery and laser eye treatments.",
      "details": "Dr. Anita Desai, an AIIMS graduate, has transformed vision care through her precision cataract surgeries and innovative laser treatments. At Vision Care Center, she implemented a high-volume surgical model that provides affordable care without compromising quality. Her 9 years of experience include developing a novel technique for complex cataract cases. Dr. Desai's free eye camps have restored vision for over 2,000 underprivileged patients."
    },
    {
      "id": "doc-8",
      "name": "Dr. David Kim",
      "image": "https://images.pexels.com/photos/7195421/pexels-photo-7195421.jpeg",
      "education": "MD, Psychiatry, Columbia University",
      "speciality": "Psychiatrist",
      "experience": "11 years",
      "registration": "MED-89012",
      "designation": "Mental Health Consultant",
      "workplace": "Mind Wellness Clinic",
      "fee": 2500,
      "availability": ["Tuesday", "Wednesday", "Friday"],
      "bio": "Specializes in cognitive behavioral therapy and anxiety disorders.",
      "details": "Columbia University-trained Dr. David Kim brings 11 years of psychiatric expertise to Mind Wellness Clinic. His integrated approach combines medication management with evidence-based psychotherapy techniques. Dr. Kim developed a highly successful anxiety management program adopted by corporate wellness programs nationwide. He serves on the advisory board of the National Alliance on Mental Illness and frequently contributes to mental health awareness campaigns."
    },
    {
      "id": "doc-9",
      "name": "Dr. Priya Patel",
      "image": "https://images.pexels.com/photos/8376280/pexels-photo-8376280.jpeg",
      "education": "MD, Gynecology, KEM Hospital",
      "speciality": "Gynecologist",
      "experience": "13 years",
      "registration": "MED-90123",
      "designation": "Women's Health Specialist",
      "workplace": "Women's Wellness Center",
      "fee": 2100,
      "availability": ["Monday", "Wednesday", "Saturday"],
      "bio": "Expert in reproductive health and prenatal care.",
      "details": "Dr. Priya Patel has dedicated 13 years to advancing women's healthcare at her Wellness Center. A KEM Hospital alumnus, she specializes in high-risk pregnancies and minimally invasive gynecologic surgeries. Dr. Patel established the city's first comprehensive menopause management program. Her prenatal care protocols have significantly reduced pregnancy complications in her practice. She regularly conducts health education workshops in underserved communities."
    },
    {
      "id": "doc-10",
      "name": "Dr. William Brown",
      "image": "https://images.pexels.com/photos/5215024/pexels-photo-5215024.jpeg",
      "education": "MD, Endocrinology, Cleveland Clinic",
      "speciality": "Endocrinologist",
      "experience": "16 years",
      "registration": "MED-01234",
      "designation": "Diabetes Specialist",
      "workplace": "Metabolic Health Institute",
      "fee": 2350,
      "availability": ["Tuesday", "Thursday", "Friday"],
      "bio": "Specializes in diabetes management and thyroid disorders.",
      "details": "Cleveland Clinic-trained endocrinologist Dr. William Brown brings 16 years of expertise in managing complex metabolic disorders. At Metabolic Health Institute, he developed a diabetes reversal program combining advanced medications with lifestyle interventions. His research on insulin resistance patterns changed national treatment guidelines. Dr. Brown's thyroid cancer detection protocol has improved early diagnosis rates by 25% in his practice."
    },
    {
      "id": "doc-11",
      "name": "Dr. Lisa Wong",
      "image": "https://images.pexels.com/photos/6749773/pexels-photo-6749773.jpeg",
      "education": "MD, Rheumatology, UCSF",
      "speciality": "Rheumatologist",
      "experience": "7 years",
      "registration": "MED-12346",
      "designation": "Arthritis Specialist",
      "workplace": "Joint Care Clinic",
      "fee": 2800,
      "availability": ["Monday", "Wednesday", "Friday"],
      "bio": "Expert in autoimmune disorders and joint pain management.",
      "details": "UCSF graduate Dr. Lisa Wong is revolutionizing rheumatology care through her targeted biologic therapies at Joint Care Clinic. Despite being relatively new with 7 years of practice, her research on lupus biomarkers earned her the Young Investigator Award. Dr. Wong's personalized treatment plans combine cutting-edge medications with physical rehabilitation. She established the first support network for young arthritis patients in the region."
    },
    {
      "id": "doc-12",
      "name": "Dr. Rajesh Kumar",
      "image": "https://images.pexels.com/photos/14438785/pexels-photo-14438785.jpeg",
      "education": "MD, Pulmonology, PGIMER",
      "speciality": "Pulmonologist",
      "experience": "14 years",
      "registration": "MED-23457",
      "designation": "Lung Health Expert",
      "workplace": "Respiratory Care Center",
      "fee": 2100,
      "availability": ["Tuesday", "Thursday", "Saturday"],
      "bio": "Specializes in asthma, COPD, and sleep apnea treatments.",
      "details": "With 14 years of pulmonary medicine experience, Dr. Rajesh Kumar leads the Respiratory Care Center's efforts against chronic lung diseases. A PGIMER alumnus, he developed the region's most comprehensive sleep apnea management program. Dr. Kumar's innovative COPD rehabilitation protocol reduced hospital readmissions by 35%. During the pandemic, he established a specialized post-COVID respiratory clinic that has treated over 1,200 patients."
    },
    {
      "id": "doc-13",
      "name": "Dr. Maria Garcia",
      "image": "https://images.pexels.com/photos/5452292/pexels-photo-5452292.jpeg",
      "education": "MD, Gastroenterology, Mount Sinai",
      "speciality": "Gastroenterologist",
      "experience": "10 years",
      "registration": "MED-34568",
      "designation": "Digestive Health Specialist",
      "workplace": "Digestive Care Institute",
      "fee": 1900,
      "availability": ["Monday", "Wednesday", "Friday"],
      "bio": "Expert in endoscopic procedures and IBS management.",
      "details": "Mount Sinai-trained Dr. Maria Garcia brings a decade of gastroenterology expertise to her Digestive Care Institute. She performs advanced endoscopic procedures including ERCP and capsule endoscopy. Dr. Garcia's research on the gut microbiome's role in IBS earned her international recognition. She implemented a novel nutrition therapy program that has helped 80% of participants achieve significant IBS symptom relief."
    },
    {
      "id": "doc-14",
      "name": "Dr. Thomas Lee",
      "image": "https://images.pexels.com/photos/5407206/pexels-photo-5407206.jpeg",
      "education": "MD, Urology, Johns Hopkins",
      "speciality": "Urologist",
      "experience": "12 years",
      "registration": "MED-45679",
      "designation": "Urology Consultant",
      "workplace": "Urology Specialists",
      "fee": 2900,
      "availability": ["Tuesday", "Thursday", "Saturday"],
      "bio": "Specializes in kidney stones and prostate health.",
      "details": "Johns Hopkins alumnus Dr. Thomas Lee has spent 12 years advancing urologic care through minimally invasive techniques. At Urology Specialists, he pioneered a kidney stone prevention program that reduced recurrence rates by 60%. Dr. Lee's prostate health screening protocol detects cancers at earlier, more treatable stages. He frequently appears as a medical expert discussing men's health issues on national television programs."
    },
    {
      "id": "doc-15",
      "name": "Dr. Aisha Mohammed",
      "image": "https://images.pexels.com/photos/6291089/pexels-photo-6291089.jpeg",
      "education": "MD, Oncology, MD Anderson",
      "speciality": "Oncologist",
      "experience": "15 years",
      "registration": "MED-56780",
      "designation": "Cancer Specialist",
      "workplace": "Cancer Care Center",
      "fee": 2210,
      "availability": ["Monday", "Wednesday", "Friday"],
      "bio": "Expert in chemotherapy protocols and targeted therapies.",
      "details": "MD Anderson-trained oncologist Dr. Aisha Mohammed brings 15 years of cancer treatment expertise to her practice. She specializes in precision oncology, using genetic profiling to customize treatment plans. Dr. Mohammed established the region's first comprehensive survivorship program addressing long-term effects of cancer treatment. Her clinical trials on immunotherapy combinations have shown remarkable success in advanced-stage patients. She serves on the National Cancer Advisory Board."
    }
  ]
}
